[Killed] BlockStatement
src/movies/external-api.service.ts:21:5
   constructor(
     private readonly httpService: HttpService,
     private readonly configService: ConfigService,
-  ) {
-    this.tmdbApiKey = this.configService.get<string>("TMDB_API_KEY")!;
-    this.omdbApiKey = this.configService.get<string>("OMDB_API_KEY")!;
-  }
+  ) {}
 
   // Пошук
killedBy: ExternalApiService fetchOmdbData should return data from API if successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "apikey=KEY"
Received: "https://www.omdbapi.com/?i=tt12345&apikey=undefined"

Number of calls: 1

[Survived] StringLiteral
src/movies/external-api.service.ts:22:54
     private readonly httpService: HttpService,
     private readonly configService: ConfigService,
   ) {
-    this.tmdbApiKey = this.configService.get<string>("TMDB_API_KEY")!;
+    this.tmdbApiKey = this.configService.get<string>("")!;
     this.omdbApiKey = this.configService.get<string>("OMDB_API_KEY")!;
   }

[NoCoverage] StringLiteral
src/movies/external-api.service.ts:35:17
 
   // Деталі з TMDB
   async fetchTmdbMovie(id: string): Promise<TmdbMovieDto> {
-    const url = `${this.tmdbBaseUrl}/movie/${id}?api_key=${this.tmdbApiKey}&language=uk-UA`;
+    const url = ``;
     const { data } = await firstValueFrom(this.httpService.get<TmdbMovieDto>(url));
     return data;

[Killed] BooleanLiteral
src/movies/external-api.service.ts:42:9
 
   // Деталі з OMDB
   async fetchOmdbData(imdbId: string): Promise<OmdbMovieDto> {
-    if (!imdbId) {
+    if (imdbId) {
       // Повертаємо заглушку, якщо IMDB ID немає
       return { Rated: "N/A", Awards: "N/A", Ratings: [] };
killedBy: ExternalApiService fetchOmdbData should return data from API if successful
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PG-13"
Received: "N/A"

[Killed] ConditionalExpression
src/movies/external-api.service.ts:42:9
 
   // Деталі з OMDB
   async fetchOmdbData(imdbId: string): Promise<OmdbMovieDto> {
-    if (!imdbId) {
+    if (true) {
       // Повертаємо заглушку, якщо IMDB ID немає
       return { Rated: "N/A", Awards: "N/A", Ratings: [] };
killedBy: ExternalApiService fetchOmdbData should return data from API if successful
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PG-13"
Received: "N/A"

[Killed] StringLiteral
src/movies/external-api.service.ts:47:19
       return { Rated: "N/A", Awards: "N/A", Ratings: [] };
     }
     try {
-      const url = `https://www.omdbapi.com/?i=${imdbId}&apikey=${this.omdbApiKey}`;
+      const url = ``;
       const { data } = await firstValueFrom(this.httpService.get<OmdbMovieDto>(url));
       return data;
killedBy: ExternalApiService fetchOmdbData should return data from API if successful
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "apikey=KEY"
Received: ""

Number of calls: 1

[Survived] BlockStatement
src/movies/external-api.service.ts:52:31
       return data;
     } catch (e) {
       // Додаємо перевірку типу, щоб безпечно отримати повідомлення про помилку, бо еслінт не пускає без неї
-      if (e instanceof Error) {
-        console.error("OMDB fetch error, returning fallback:", e.message);
-      } else {
+      if (e instanceof Error) {} else {
         // Якщо це не стандартна помилка Error, виводимо її як є
         console.error("OMDB fetch error, returning fallback. Unknown error:", e);

[Survived] ConditionalExpression
src/movies/external-api.service.ts:52:11
       return data;
     } catch (e) {
       // Додаємо перевірку типу, щоб безпечно отримати повідомлення про помилку, бо еслінт не пускає без неї
-      if (e instanceof Error) {
+      if (false) {
         console.error("OMDB fetch error, returning fallback:", e.message);
       } else {

[NoCoverage] BlockStatement
src/movies/external-api.service.ts:54:14
       // Додаємо перевірку типу, щоб безпечно отримати повідомлення про помилку, бо еслінт не пускає без неї
       if (e instanceof Error) {
         console.error("OMDB fetch error, returning fallback:", e.message);
-      } else {
-        // Якщо це не стандартна помилка Error, виводимо її як є
-        console.error("OMDB fetch error, returning fallback. Unknown error:", e);
-      }
+      } else {}
 
       // Якщо OMDB не спрацював, ми повертаємо заглушку, щоб не зламати нам сайт

[NoCoverage] StringLiteral
src/movies/external-api.service.ts:56:23
         console.error("OMDB fetch error, returning fallback:", e.message);
       } else {
         // Якщо це не стандартна помилка Error, виводимо її як є
-        console.error("OMDB fetch error, returning fallback. Unknown error:", e);
+        console.error("", e);
       }
 

[Killed] StringLiteral
src/movies/external-api.service.ts:60:38
       }
 
       // Якщо OMDB не спрацював, ми повертаємо заглушку, щоб не зламати нам сайт
-      return { Rated: "N/A", Awards: "N/A", Ratings: [] };
+      return { Rated: "N/A", Awards: "", Ratings: [] };
     }
   }
killedBy: ExternalApiService fetchOmdbData should return fallback data if API throws an error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "N/A"
Received: ""

[Killed] ArrowFunction
src/movies/external-api.service.ts:68:32
   async fetchTrailers(id: string): Promise<TmdbVideoDto[]> {
     const url = `${this.tmdbBaseUrl}/movie/${id}/videos?api_key=${this.tmdbApiKey}`;
     const { data } = await firstValueFrom(this.httpService.get<{ results: TmdbVideoDto[] }>(url));
-    return data.results.filter((video) => video.site === "YouTube" && video.type === "Trailer");
+    return data.results.filter(() => undefined);
   }
 }
killedBy: ExternalApiService fetchTrailers should return only YouTube trailers with type Trailer
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/movies/external-api.service.ts:68:71
   async fetchTrailers(id: string): Promise<TmdbVideoDto[]> {
     const url = `${this.tmdbBaseUrl}/movie/${id}/videos?api_key=${this.tmdbApiKey}`;
     const { data } = await firstValueFrom(this.httpService.get<{ results: TmdbVideoDto[] }>(url));
-    return data.results.filter((video) => video.site === "YouTube" && video.type === "Trailer");
+    return data.results.filter((video) => video.site === "YouTube" && true);
   }
 }
killedBy: ExternalApiService fetchTrailers should return only YouTube trailers with type Trailer
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  [{"key": "123", "name": "Trailer 1", "site": "YouTube", "type": "Trailer"}, {"key": "789", "name": "Teaser", "site": "YouTube", "type": "Teaser"}]
