[Killed] ObjectLiteral
src/movies/movies.service.ts:25:7
   private async upsertMovie(movieData: CombinedMovieData): Promise<MovieDocument> {
     const movie = await this.movieModel.findOneAndUpdate(
       { movieId: movieData.id.toString() },
-      {
-        $set: {
-          movieId: movieData.id.toString(),
-          title: movieData.title,
-          tmdbRating: movieData.vote_average_tmdb,
-        },
-      },
+      {},
       {
         upsert: true,
killedBy: MoviesService (Integration) should insert a new Movie into MongoDB after fetching data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Integration Test Movie"
Received: undefined

[NoCoverage] BlockStatement
src/movies/movies.service.ts:44:21
   async getMovieById(id: string): Promise<CombinedMovieData> {
     const cacheKey = `MOVIE_${id}`;
     const cachedData = await this.cacheManager.get<CombinedMovieData>(cacheKey);
-    if (cachedData) {
-      console.log(`LOG: Повертаю фільм ${id} з кешу`);
-      return cachedData;
-    }
+    if (cachedData) {}
     console.log(`LOG: Запитую фільм ${id} з API`);
 

[Survived] ArrowFunction
src/movies/movies.service.ts:68:42
     };
 
     // Логіка кешування та збереження в БД
-    this.upsertMovie(combinedData).catch((err) => console.error("Failed to upsert movie", err));
+    this.upsertMovie(combinedData).catch(() => undefined);
 
     await this.cacheManager.set(cacheKey, combinedData);

[Killed] BlockStatement
src/movies/movies.service.ts:78:21
   async searchMovies(query: string): Promise<TmdbSearchResultDto[]> {
     const cacheKey = `SEARCH_${query}`;
     const cachedData = await this.cacheManager.get<TmdbSearchResultDto[]>(cacheKey);
-    if (cachedData) {
-      console.log(`LOG: Повертаю пошук "${query}" з кешу`);
-      return cachedData;
-    }
+    if (cachedData) {}
     console.log(`LOG: Запитую пошук "${query}" з API`);
 
killedBy: MoviesService searchMovies should return cached data if available
statusReason: TypeError: Cannot destructure property 'results' of '(intermediate value)' as it is undefined.

[Survived] StringLiteral
src/movies/movies.service.ts:82:17
       console.log(`LOG: Повертаю пошук "${query}" з кешу`);
       return cachedData;
     }
-    console.log(`LOG: Запитую пошук "${query}" з API`);
+    console.log(``);
 
     // Делегуємо виклик API

[NoCoverage] BlockStatement
src/movies/movies.service.ts:95:21
   async getTrailers(id: string): Promise<TmdbVideoDto[]> {
     const cacheKey = `TRAILERS_${id}`;
     const cachedData = await this.cacheManager.get<TmdbVideoDto[]>(cacheKey);
-    if (cachedData) {
-      console.log(`LOG: Повертаю трейлери ${id} з кешу`);
-      return cachedData;
-    }
+    if (cachedData) {}
     console.log(`LOG: Запитую трейлери ${id} з API`);
 

[NoCoverage] StringLiteral
src/movies/movies.service.ts:96:19
     const cacheKey = `TRAILERS_${id}`;
     const cachedData = await this.cacheManager.get<TmdbVideoDto[]>(cacheKey);
     if (cachedData) {
-      console.log(`LOG: Повертаю трейлери ${id} з кешу`);
+      console.log(``);
       return cachedData;
     }

[NoCoverage] StringLiteral
src/movies/movies.service.ts:99:17
       console.log(`LOG: Повертаю трейлери ${id} з кешу`);
       return cachedData;
     }
-    console.log(`LOG: Запитую трейлери ${id} з API`);
+    console.log(``);
 
     // Делегуємо виклик API
